pbecchi/ESP32-Sprinkler/Defines.h
/* OpenSprinkler Unified (AVR/RPI/BBB/LINUX) Firmware
 * Copyright (C) 2015 by Ray Wang (ray@opensprinkler.com)
 *
 * OpenSprinkler macro defines and hardware pin assignments
 * Feb 2015 @ OpenSprinkler.com
 *
 * This file is part of the OpenSprinkler library
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see
 * <http://www.gnu.org/licenses/>.
 */

#ifndef _DEFINES_H
#define _DEFINES_H
//#define HOSTNAM

#include <Arduino.h>
#include "Config.h"
#include "libsel.h"
#include "Pins.h"
/** Firmware version, hardware version, and maximal values */

#define OS_FW_VERSION			216		// Firmware version: 216 means 2.1.6
										// if this number is different from the one stored in non-volatile memory
										// a device reset will be automatically triggered
#ifdef OS217
 #define OS_FW_VERSION    217
#endif

#define OS_FW_MINOR				1		// Firmware minor version
#define PINMODE pinMode
/** Hardware version base numbers */
#define OS_HW_VERSION_BASE		0x00
#define OSPI_HW_VERSION_BASE	0x40
#define OSBO_HW_VERSION_BASE	0x80
#define SIM_HW_VERSION_BASE		0xC0

/** Hardware type macro defines */
#define HW_TYPE_AC				0xAC	// standard 24VAC for 24VAC solenoids only, with triacs
#define HW_TYPE_DC				0xDC	// DC powered, for both DC and 24VAC solenoids, with boost converter and MOSFETs
#define HW_TYPE_LATCH			0x1A	// DC powered, for DC latching solenoids only, with boost converter and H-bridges

/** File names */
#define WEATHER_OPTS_FILENAME "wtopts.txt"    // weather options file
#define STATION_ATTR_FILENAME "stns.dat"      // station attributes data file
#define STATION_SPECIAL_DATA_SIZE  23

#define FLOWCOUNT_RT_WINDOW		30    // flow count window (for computing real-time flow rate), 30 seconds

/** Station type macro defines */
#define STN_TYPE_STANDARD		0x00
#define STN_TYPE_RF				0x01
#define STN_TYPE_REMOTE			0x02
#define STN_TYPE_OTHER			0xFF

/** Sensor type macro defines */
#define SENSOR_TYPE_NONE		0x00
#ifdef OS217
#define SENSOR_TYPE_PSWITCH 0xF0
#endif
//________________________________________________________________________________________________________________________
#define SENSOR_TYPE_RAIN		0x01
#define SENSOR_TYPE_FLOW		0x02
#define SENSOR_TYPE_OTHER		0xFF


//#undef OS_HW_VERSION

/** Hardware defines */
#if defined(ARDUINO)

#if F_CPU==8000000L
#define OS_HW_VERSION (OS_HW_VERSION_BASE+20)
#elif F_CPU==12000000L
#define OS_HW_VERSION (OS_HW_VERSION_BASE+21)
#elif F_CPU==16000000L
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
#define OS_HW_VERSION (OS_HW_VERSION_BASE+23)
#else
#define OS_HW_VERSION (OS_HW_VERSION_BASE+22)
#endif
#endif
#include "Pins.h"


/** Non-volatile memory (NVM) defines */
#if defined(ARDUINO)

	/** 2KB NVM (ATmega644) data structure:
	  * |         |     |  ---STRING PARAMETERS---      |           |   ----STATION ATTRIBUTES-----      |          |
	  * | PROGRAM | CON | PWD | LOC | JURL | WURL | KEY | STN_NAMES | MAS | IGR | MAS2 | DIS | SEQ | SPE | OPTIONS  |
	  * |  (996)  |(12) |(36) |(48) | (40) | (40) |(24) |   (768)   | (6) | (6) |  (6) | (6) | (6) | (6) |  (48)    |
	  * |         |     |     |     |      |      |     |           |     |     |      |     |     |     |          |
	  * 0        996  1008   1044  1092  1132   1172   1196        1964  1970  1976   1982  1988  1994  2000      2048
	  */

	/** 4KB NVM (ATmega1284) data structure:
	  * |         |     |  ---STRING PARAMETERS---      |           |   ----STATION ATTRIBUTES-----      |          |
	  * | PROGRAM | CON | PWD | LOC | JURL | WURL | KEY | STN_NAMES | MAS | IGR | MAS2 | DIS | SEQ | SPE | OPTIONS  |
	  * |  (2438) |(12) |(36) |(48) | (48) | (48) |(24) |   (1344)  | (7) | (7) |  (7) | (7) | (7) | (7) |   (56)   |
	  * |         |     |     |     |      |      |     |           |     |     |      |     |     |     |          |
	  * 0       2438  2450   2486  2534  2582   2630   2654        3998  4005  4012   4019  4026  4033  4040      4096
	  */

	  /** 4KB NVM (OS217) data structure:
	  *******
	  ********** in SGxx the CHANGED NVM structure see Tables_SG_20_vxx.xls file
	  ******
	  * |         |     |  ---STRING PARAMETERS---      |           |   ----STATION ATTRIBUTES-----      |          |
	  * | PROGRAM | CON | PWD | LOC | JURL | WURL | KEY | STN_NAMES | MAS | IGR | MAS2 | DIS | SEQ | SPE | OPTIONS  |
	  * |  (2433) |(12) |(36) |(48) | (48) | (48) |(24) |   (1344)  | (7) | (7) |  (7) | (7) | (7) | (7) |   (61)   |
	  * |         |     |     |     |      |      |     |           |     |     |      |     |     |     |          |
	  * 0       2433  2445   2481  2529  2577   2625   2649        3993  4000  4007   4014  4021  4028  4035      4096
	  */
	#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)//|| defined(BATTERY) // for 4KB NVM

		#define MAX_EXT_BOARDS    6  // maximum number of exp. boards (each expands 8 stations)
#define MAX_PROGRAMDATA     2433  // program data
		#define MAX_NUM_STATIONS  ((1+MAX_EXT_BOARDS)*8)  // maximum number of stations

		#define NVM_SIZE            4096  // For AVR, nvm data is stored in EEPROM, ATmega1284 has 4K EEPROM
		#define STATION_NAME_SIZE   24    // maximum number of characters in each station name

		#define MAX_NVCONDATA       12    // non-volatile controller data
		#define MAX_USER_PASSWORD   36    // user password
		#define MAX_LOCATION        48    // location string
		#define MAX_JAVASCRIPTURL   48    // javascript url
		#define MAX_WEATHERURL      48    // weather script url
		#define MAX_WEATHER_KEY     24    // weather api key

	#else

		#define MAX_EXT_BOARDS		5  // maximum number of exp. boards (each expands 8 stations)
		#define MAX_NUM_STATIONS	((1+MAX_EXT_BOARDS)*8)  // maximum number of stations
#ifdef BATTERY							//more room to store battery options
		#define NVM_SIZE 3072
#elif defined(LORA)
        #define NVM_SIZE 3072
#else
		#define NVM_SIZE            2048  // For AVR, nvm data is stored in EEPROM, ATmega644 has 2K EEPROM
#endif
        #define STATION_NAME_SIZE   16    // maximum number of characters in each station name

		#define MAX_PROGRAMDATA     996   // program data
		#define MAX_NVCONDATA       12     // non-volatile controller data
		#define MAX_USER_PASSWORD   36    // user password
		#define MAX_LOCATION        48    // location string
		#define MAX_JAVASCRIPTURL   40    // javascript url
		#define MAX_WEATHERURL      40    // weather script url
		#define MAX_WEATHER_KEY     24    // weather api key,

	#endif

#else // NVM defines for RPI/BBB/LINUX

