pbecchi/ESP32-Sprinkler/Defines.h
	// These are kept the same as AVR for compatibility reasons
	// But they can be increased if needed
	#define NVM_FILENAME        "nvm.dat" // for RPI/BBB, nvm data is stored in a file

	#define MAX_EXT_BOARDS    6  // maximum number of exp. boards (each expands 8 stations)
	#define MAX_NUM_STATIONS  ((1+MAX_EXT_BOARDS)*8)  // maximum number of stations

	#define NVM_SIZE            4096
	#define STATION_NAME_SIZE   24    // maximum number of characters in each station name

	#define MAX_PROGRAMDATA     2438  // program data
	#define MAX_NVCONDATA       12     // non-volatile controller data
	#define MAX_USER_PASSWORD   36    // user password
	#define MAX_LOCATION        48    // location string
	#define MAX_JAVASCRIPTURL   48    // javascript url
	#define MAX_WEATHERURL      48    // weather script url
	#define MAX_WEATHER_KEY     24    // weather api key

#endif  // end of NVM defines

/** NVM data addresses */
#define ADDR_NVM_PROGRAMS      (0)   // program starting address
#define ADDR_NVM_NVCONDATA     (ADDR_NVM_PROGRAMS+MAX_PROGRAMDATA)
#define ADDR_NVM_PASSWORD      (ADDR_NVM_NVCONDATA+MAX_NVCONDATA)
#define ADDR_NVM_LOCATION      (ADDR_NVM_PASSWORD+MAX_USER_PASSWORD)
#define ADDR_NVM_JAVASCRIPTURL (ADDR_NVM_LOCATION+MAX_LOCATION)
#define ADDR_NVM_WEATHERURL    (ADDR_NVM_JAVASCRIPTURL+MAX_JAVASCRIPTURL)
#define ADDR_NVM_WEATHER_KEY   (ADDR_NVM_WEATHERURL+MAX_WEATHERURL)
#define ADDR_NVM_STN_NAMES     (ADDR_NVM_WEATHER_KEY+MAX_WEATHER_KEY)
#define ADDR_NVM_MAS_OP        (ADDR_NVM_STN_NAMES+MAX_NUM_STATIONS*STATION_NAME_SIZE) // master op bits
#define ADDR_NVM_IGNRAIN       (ADDR_NVM_MAS_OP+(MAX_EXT_BOARDS+1))  // ignore rain bits
#define ADDR_NVM_MAS_OP_2      (ADDR_NVM_IGNRAIN+(MAX_EXT_BOARDS+1)) // master2 op bits
#define ADDR_NVM_STNDISABLE    (ADDR_NVM_MAS_OP_2+(MAX_EXT_BOARDS+1))// station disable bits
#define ADDR_NVM_STNSEQ        (ADDR_NVM_STNDISABLE+(MAX_EXT_BOARDS+1))// station sequential bits
#define ADDR_NVM_STNSPE        (ADDR_NVM_STNSEQ+(MAX_EXT_BOARDS+1)) // station special bits (i.e. non-standard stations)
#define ADDR_NVM_OPTIONS       (ADDR_NVM_STNSPE+(MAX_EXT_BOARDS+1))  // options

/** Default password, location string, weather key, script urls */
#define DEFAULT_PASSWORD          "a6d82bced638de3def1e9bbb4983225c"
#define DEFAULT_LOCATION          "Boston,MA"
#define DEFAULT_WEATHER_KEY       "e409b2aeaa5e3ffe"	// replace this key with your own
#define DEFAULT_JAVASCRIPT_URL    "https://ui.opensprinkler.com/js"
#define DEFAULT_WEATHER_URL       "weather.opensprinkler.com"


/** Macro define of each option
  * Refer to OpenSprinkler.cpp for details on each option
  */

typedef enum
{
    OPTION_FW_VERSION = 0,
    OPTION_TIMEZONE,
    OPTION_USE_NTP,
    OPTION_USE_DHCP,
    OPTION_STATIC_IP1,
    OPTION_STATIC_IP2,
    OPTION_STATIC_IP3,
    OPTION_STATIC_IP4,
    OPTION_GATEWAY_IP1,
    OPTION_GATEWAY_IP2,
    OPTION_GATEWAY_IP3,
    OPTION_GATEWAY_IP4,
    OPTION_HTTPPORT_0,
    OPTION_HTTPPORT_1,
    OPTION_HW_VERSION,
    OPTION_EXT_BOARDS,
    OPTION_SEQUENTIAL_RETIRED,
    OPTION_STATION_DELAY_TIME,
    OPTION_MASTER_STATION,
    OPTION_MASTER_ON_ADJ,
    OPTION_MASTER_OFF_ADJ,
    OPTION_SENSOR_TYPE,
    OPTION_RAINSENSOR_TYPE,
    OPTION_WATER_PERCENTAGE,
    OPTION_DEVICE_ENABLE,
    OPTION_IGNORE_PASSWORD,
    OPTION_DEVICE_ID,
    OPTION_LCD_CONTRAST,
    OPTION_LCD_BACKLIGHT,
    OPTION_LCD_DIMMING,
    OPTION_BOOST_TIME,
    OPTION_USE_WEATHER,
    OPTION_NTP_IP1,
    OPTION_NTP_IP2,
    OPTION_NTP_IP3,
    OPTION_NTP_IP4,
    OPTION_ENABLE_LOGGING,
    OPTION_MASTER_STATION_2,
    OPTION_MASTER_ON_ADJ_2,
    OPTION_MASTER_OFF_ADJ_2,
    OPTION_FW_MINOR,
    OPTION_PULSE_RATE_0,
    OPTION_PULSE_RATE_1,
    OPTION_REMOTE_EXT_MODE,
#ifdef OS217
	OPTION_DNS_IP1,
	OPTION_DNS_IP2,
	OPTION_DNS_IP3,
	OPTION_DNS_IP4,
	OPTION_SPE_AUTO_REFRESH,
	OPTION_IFTTT_ENABLE,
#endif
//	_________________________________________________________________________________________________
    OPTION_RESET,
#ifdef BATTERY
	D_SLEEP_DURATION,
	D_SLEEP_START_TIME,
	D_SLEEP_INTERVAL,
	MIN_VOLTS_D_SLEEP,
	MIN_VOLTS_L_SLEEP,
	L_SLEEP_DURATION,
	BATTERY_mAH,
#endif
    NUM_OPTIONS	// total number of options
} OS_OPTION_t;
#define OPTION_RSENSOR_TYPE OPTION_SENSOR_TYPE
//_________________________________________________________________________________________________

/** Log Data Type */
#define LOGDATA_STATION    0x00
#define LOGDATA_RAINSENSE  0x01
#define LOGDATA_RAINDELAY  0x02
#define LOGDATA_WATERLEVEL 0x03
#define LOGDATA_FLOWSENSE  0x04

#ifdef GETOUT //da eliminare
#ifdef OPENSPRINKLER_ARDUINO_DISCRETE
	/* READ ME - PIN_EXT_BOARDS defines the total number of discrete digital IO pins
	used to control watering stations. There are 8 stations per extender board, that
	MUST have PIN_EXT_BOARDS x 8  pins defined below (otherwise you'll get out of range
	issues with the array of pins defined in OpenSprinklerGen2.cpp) */
	#define PIN_EXT_BOARDS	2

	/* Use these pins when the control signal to switch watering solenoids on and off
	is driven directly from the arduino digital output pins (i.e. not using a shift register
	like the regular opensprinkler hardware) */
	#define PIN_STN_S01		46
	#define PIN_STN_S02		44
	#define PIN_STN_S03		42
	#define PIN_STN_S04		40
	#define PIN_STN_S05		47
	#define PIN_STN_S06		45
	#define PIN_STN_S07		43
	#define PIN_STN_S08		41

	#define PIN_STN_S09		32
	#define PIN_STN_S10		34
	#define PIN_STN_S11     36
	#define PIN_STN_S12		38
	#define PIN_STN_S13		33
	#define PIN_STN_S14		35
	#define PIN_STN_S15		37
	#define PIN_STN_S16		39

	#define PIN_RF_DATA		30    // RF data pin - efault is 38
	#define PORT_RF			PORTA
	#define PINX_RF			PINA3

#else
#if !defined(ESP8266) && !defined(ESP32)
	// hardware pins
	#define PIN_BUTTON_1      31    // button 1
	#define PIN_BUTTON_2      30    // button 2
	#define PIN_BUTTON_3      29    // button 3
	#define PIN_RF_DATA       28    // RF data pin
	#define PORT_RF        PORTA
	#define PINX_RF        PINA3

