pbecchi/ESP32-Sprinkler/Defines.h
	#define PIN_SR_LATCH       3    // shift register latch pin
	#define PIN_SR_DATA       21    // shift register data pin
	#define PIN_SR_CLOCK      22    // shift register clock pin
	#define PIN_SR_OE          1    // shift register output enable pin

#else //-----------------------ESP8266------------------------------------------
/*#define PIN_BUTTON_1      31    // button 1
#define PIN_BUTTON_2      30    // button 2
#define PIN_BUTTON_3      29    // button 3
#define PIN_RF_DATA       28    // RF data pin
#define PORT_RF        PORTA
#define PINX_RF        PINA3
*/
#define BUTTON_ADC_PIN    A0    // A0 is the button ADC input
#define SDA_PIN          D5
#define SCL_PIN          D2
#define PIN_SR_LATCH       D3    // shift register latch pin
#define PIN_SR_DATA        D0    // shift register data pin
#define PIN_SR_CLOCK       10    // shift register clock pin
//#define PIN_SR_OE              // shift register output enable pin
#define OS_HW_VERSION    0.0
#endif//--------------------------------------------------------------------------
#endif // OPENSPRINKLER_ARDUINO_DISCRETE
#ifdef OPENSPRINKLER_ARDUINO_FREETRONICS_LCD
	/* Note - D4 on the Freetronics LCD shield clashes with the
	chipselect pin for the SD card that is also D4 on some W5100 shields.
	You may need to jumper it to D2 as described at:
	http://forum.freetronics.com/viewtopic.php?t=770 */
	
	// Freetronics LCD with pin D4 bridged to pin D2
	#define PIN_LCD_RS         8    // LCD rs pin
	#define PIN_LCD_EN         9    // LCD enable pin
	#define PIN_LCD_D4         2    // LCD D4 pin
	#define PIN_LCD_D5         5    // LCD D5 pin
	#define PIN_LCD_D6         6    // LCD D6 pin
	#define PIN_LCD_D7         7    // LCD D7 pin
	#define PIN_LCD_BACKLIGHT  3    // LCD backlight pin
	#define PIN_LCD_CONTRAST  A1    // LCD contrast pin - NOT USED FOR FREETRONICS LCD (just set this to an unused pin) 
/*
	// Freetronics LCD 
	#define PIN_LCD_RS         8    // LCD rs pin - default = 19
	#define PIN_LCD_EN         9    // LCD enable pin - default = 18
	#define PIN_LCD_D4         4    // LCD d4 pin - default = 20
	#define PIN_LCD_D5         5    // LCD d5 pin - default = 21
	#define PIN_LCD_D6         6    // LCD d6 pin - default = 22
	#define PIN_LCD_D7         7    // LCD d7 pin - default = 23
	#define PIN_LCD_BACKLIGHT  3    // LCD backlight pin - default = 12
	#define PIN_LCD_CONTRAST  A1    // LCD contrast pin - NOT USED FOR FREETRONICS LCD (just set this to an unused pin) 
*/
	// some example macros with friendly labels for LCD backlight / pin control
	#define LCD_BACKLIGHT_OFF()     digitalWrite( PIN_LCD_BACKLIGHT, LOW )
	#define LCD_BACKLIGHT_ON()      digitalWrite( PIN_LCD_BACKLIGHT, HIGH )
	#define LCD_BACKLIGHT(state)    {if( state ){digitalWrite( PIN_LCD_BACKLIGHT, HIGH );}else{digitalWrite( PIN_LCD_BACKLIGHT, LOW );} }
    #define BUTTON_ADC_PIN    A0    // A0 is the button ADC input

#else
	// regular 16x2 LCD pin defines
	#define PIN_LCD_RS        19    // LCD rs pin
	#define PIN_LCD_EN        18    // LCD enable pin
	#define PIN_LCD_D4        20    // LCD d4 pin
	#define PIN_LCD_D5        21    // LCD d5 pin
	#define PIN_LCD_D6        22    // LCD d6 pin
	#define PIN_LCD_D7        23    // LCD d7 pin
	#define PIN_LCD_BACKLIGHT 12    // LCD backlight pin
	#define PIN_LCD_CONTRAST  13    // LCD contrast pin
#endif // OPENSPRINKLER_ARDUINO_FREETRONICS_LCD
#ifdef BUTTON_ADC_PIN

	// ADC readings expected for the 5 buttons on the ADC input

#define RIGHT_10BIT_ADC    80   // right
#define UP_10BIT_ADC     150   // up
#define DOWN_10BIT_ADC   240    // down
#define LEFT_10BIT_ADC   400   // left
#define SELECT_10BIT_ADC  280    // select
#define BUTTONHYSTERESIS  16    // hysteresis for valid button sensing window

#define BUTTON_RIGHT       1    // values used for detecting analog buttons
#define BUTTON_UP          2    // 
#define BUTTON_DOWN        3    // 
#define BUTTON_LEFT        4    // 
#define BUTTON_SELECT      5    //   
#endif
#ifndef OPENSPRINKLER_ARDUINO_DISCRETE
	// DC controller pin defines
	#define PIN_BOOST         20    // booster pin
	#define PIN_BOOST_EN      23    // boost voltage enable pin
#endif // OPENSPRINKLER_ARDUINO_DISCRETE

#ifdef OPENSPRINKLER_ARDUINO_HEARTBEAT
	#define PIN_HEARTBEAT     13    // Pin to show a heartbeat LED
#endif // OPENSPRINKLER_ARDUINO_HEARTBEAT

#ifdef OPENSPRINKLER_ARDUINO_W5100 // Wiznet W5100
	#define PIN_ETHER_CS     10    // Ethernet controller chip select pin - default is 10
	#define PIN_SD_CS        4     // SD card chip select pin - default is 4

	// Define the chipselect pins for all SPI devices attached to the arduino
	// Unused pins needs to be pulled high otherwise SPI doesn't work properly
	#define SPI_DEVICES   0      // number of SPI devices
	const uint8_t spi_ss_pin[] =   // SS pin for each device
	{
		53,						   // SD card chipselect on standard Arduino W5100 Ethernet board
		34						   // Ethernet chipselect on standard Arduino W5100 Ethernet board
	};
#else
	#define PIN_ETHER_CS      53    // Ethernet controller chip select pin
	#define PIN_SD_CS         34    // SD card chip select pin
#endif // OPENSPRINKLER_ARDUINO_W5100

#ifdef OPENSPRINKLER_ARDUINO_DISCRETE
// You'll need to use different pins for these items if you have them connected
#define PIN_RAINSENSOR     18    // rain sensor is connected to pin D3
#define PIN_FLOWSENSOR     19    // flow sensor (currently shared with rain sensor, change if using a different pin)
#define PIN_FLOWSENSOR_INT 20    // flow sensor interrupt pin (INT1)
#define PIN_EXP_SENSE      21    // expansion board sensing pin (A4)
#define PIN_CURR_SENSE     A3    // current sensing pin (A7)
#define PIN_CURR_DIGITAL   A3    // digital pin index for A7
#else
#if defined(ESP8266) || defined(ESP32)
#define PIN_RAINSENSOR    D6    // rain sensor is connected to pin D3
#define PIN_FLOWSENSOR    D1    // flow sensor (currently shared with rain sensor, change if using a different pin)
#define PIN_FLOWSENSOR_INT 5    // flow sensor interrupt pin (INT1)
#define PIN_EXP_SENSE      D6    // expansion board sensing pin (A4)
#else
#define PIN_RAINSENSOR    11    // rain sensor is connected to pin D3
#define PIN_FLOWSENSOR    11    // flow sensor (currently shared with rain sensor, change if using a different pin)
#define PIN_FLOWSENSOR_INT 1    // flow sensor interrupt pin (INT1)
#define PIN_EXP_SENSE      4    // expansion board sensing pin (A4)
#define PIN_CURR_SENSE     7    // current sensing pin (A7)
#define PIN_CURR_DIGITAL  24    // digital pin index for A7
#endif
#endif
#endif //GETOUT
// Ethernet buffer size
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
#define ETHER_BUFFER_SIZE   1500 // ATmega1284 has 16K RAM, so use a bigger buffer
#else
#define ETHER_BUFFER_SIZE   960  // ATmega644 has 4K RAM, so use a smaller buffer
#endif

#ifdef OPENSPRINKLER_ARDUINO_AUTOREBOOT
#define REBOOT_HR            12     // hour to perform daily reboot
#define REBOOT_MIN           00     // min  to perform daily reboot
#define REBOOT_SEC           00     // sec  to perform daily reboot
#endif	// OPENSPRINKLER_ARDUINO_AUTOREBOOT

