pbecchi/ESP32-Sprinkler/Defines.h
#ifdef OPENSPRINKLER_ARDUINO_WDT
#if !defined(ESP8266) && !defined(ESP32)
#define 	wdt_reset()   __asm__ __volatile__ ("wdr")  // watchdog timer reset
#endif
#endif	// OPENSPRINKLER_ARDUINO_WDT
#define DEBUG_BEGIN(x)   Serial.begin(x)
#define SERIAL_DEBUG
#if defined(SERIAL_DEBUG) /** Serial debug functions */
extern byte DB;
extern int nDB;
// db_mask opensprinklerserver 32
//         utils               8
//         opensprinklermain   2
//         ethercardW5100	   4
//         weather            16
//			opensprinkler      1
//         SG21 sensores      64
#define DB_MASK 0xFF
#define DEBUG_COMMAND  if(Serial.available()){char c=Serial.read(); nDB=0;  while(Serial.available()){if(c>='0'){nDB=nDB*10;nDB+=c-'0';}c=Serial.read();}Serial.print("->");Serial.println(nDB);if(nDB<256)DB=nDB;}

#define DEBUG_PRINTF(x,y)   if(DB&DB_MASK) Serial.print(x,y)
#define DEBUG_PRINT(x)  if(DB&DB_MASK) Serial.print(x)
#define DEBUG_PRINTLN(x) if(DB&DB_MASK) Serial.println(x)  //;Serial.print(DB,DEC);Serial.println(DB_MASK,DEC);
#else
#define DEBUG_PRINTF {}
#define DEBUG_COMMAND {}
//#define DEBUG_BEGIN(x)   {}
#define DEBUG_PRINT(x)   {}
#define DEBUG_PRINTLN(x) {}
#endif
#if !defined(ESP8266) && !defined(ESP32)
	typedef unsigned char   uint8_t;
	typedef unsigned int    uint16_t;
	typedef int int16_t;
#endif
#ifdef OPENSPRINKLER_ARDUINO
#if !defined(ESP8266) && !defined(ESP32)
	typedef const char prog_char;
	typedef const char prog_uchar;
#endif
#endif

#endif // Hardware defines for RPI/BBB
#ifdef PIPPO
/** OSPi pin defines */
#if defined(OSPI)

#define OS_HW_VERSION    OSPI_HW_VERSION_BASE
#define PIN_SR_LATCH      22    // shift register latch pin
#define PIN_SR_DATA       27    // shift register data pin
#define PIN_SR_DATA_ALT   21    // shift register data pin (alternative, for RPi 1 rev. 1 boards)
#define PIN_SR_CLOCK       4    // shift register clock pin
#define PIN_SR_OE         17    // shift register output enable pin
#define PIN_RAINSENSOR    14    // rain sensor
#define PIN_FLOWSENSOR    14    // flow sensor (currently shared with rain sensor, change if using a different pin)
#define PIN_RF_DATA       15    // RF transmitter pin
#define PIN_BUTTON_1      23    // button 1
#define PIN_BUTTON_2      24    // button 2
#define PIN_BUTTON_3      25    // button 3

/** BBB pin defines */
#elif defined(OSBO)

#define OS_HW_VERSION    OSBO_HW_VERSION_BASE
// these are gpio pin numbers, refer to
// https://github.com/mkaczanowski/BeagleBoneBlack-GPIO/blob/master/GPIO/GPIOConst.cpp
#define PIN_SR_LATCH      60    // P9_12, shift register latch pin
#define PIN_SR_DATA       30    // P9_11, shift register data pin
#define PIN_SR_CLOCK      31    // P9_13, shift register clock pin
#define PIN_SR_OE         50    // P9_14, shift register output enable pin
#define PIN_RAINSENSOR    48    // P9_15, rain sensor is connected to pin D3
#define PIN_FLOWSENSOR    48    // flow sensor (currently shared with rain sensor, change if using a different pin)
#define PIN_RF_DATA       51    // RF transmitter pin

#else
// For Linux or other software simulators
// use fake hardware pins
#if defined(DEMO)
#define OS_HW_VERSION 255   // assign hardware number 255 to DEMO firmware
#else
#define OS_HW_VERSION SIM_HW_VERSION_BASE
#endif
#define PIN_SR_LATCH    0
#define PIN_SR_DATA     0
#define PIN_SR_CLOCK    0
#define PIN_SR_OE       0
#define PIN_RAINSENSOR  0
#define PIN_FLOWSENSOR  0
#define PIN_RF_DATA     0

#endif

#define ETHER_BUFFER_SIZE   16384

#define DEBUG_BEGIN(x)          {}  /** Serial debug functions */
#define ENABLE_DEBUG
#if defined(ENABLE_DEBUG)
inline  void DEBUG_PRINT ( int x )
{
    printf ( "%d", x );
}
inline  void DEBUG_PRINT ( const char*s )
{
    printf ( "%s", s );
}
#define DEBUG_PRINTLN(x)        {DEBUG_PRINT(x);printf("\n");}
#else
#define DEBUG_PRINT(x) {}
#define DEBUG_PRINTLN(x) {}
#endif

inline void itoa ( int v,char *s,int b )
{
    sprintf ( s,"%d",v );
}
inline void ultoa ( unsigned long v,char *s,int b )
{
    sprintf ( s,"%lu",v );
}
#define now()       time(0)

/** Re-define avr-specific (e.g. PGM) types to use standard types */
#define pgm_read_byte(x) *(x)
#define PSTR(x)      x
#define strcat_P     strcat
#define strcpy_P     strcpy
#define PROGMEM
typedef const char prog_char;
typedef const char prog_uchar;
typedef const char* PGM_P;
typedef unsigned char   uint8_t;
typedef short           int16_t;
typedef unsigned short  uint16_t;
typedef bool boolean;
#define PIN_RAINSENSOR    11    // rain sensor is connected to pin D3
#define PIN_FLOWSENSOR    11    // flow sensor (currently shared with rain sensor, change if using a different pin)
#define PIN_CURR_SENSE     7    // current sensing pin (A7)
#define PIN_CURR_DIGITAL  24    // digital pin index for A7
#endif  // end of Hardawre defines


#define TMP_BUFFER_SIZE     128  // scratch buffer size

/** Other defines */
// button values
#define BUTTON_1            0x01
#define BUTTON_2            0x02
#define BUTTON_3            0x04

// button status values
#define BUTTON_NONE         0x00  // no button pressed
#define BUTTON_MASK         0x0F  // button status mask
#define BUTTON_FLAG_HOLD    0x80  // long hold flag
#define BUTTON_FLAG_DOWN    0x40  // down flag
#define BUTTON_FLAG_UP      0x20  // up flag

// button timing values
#define BUTTON_DELAY_MS        1  // short delay (milliseconds)
#define BUTTON_HOLD_MS      1000  // long hold expiration time (milliseconds)

// button mode values
#define BUTTON_WAIT_NONE       0  // do not wait, return value immediately
#define BUTTON_WAIT_RELEASE    1  // wait until button is release
#define BUTTON_WAIT_HOLD       2  // wait until button hold time expires

#define DISPLAY_MSG_MS      2000  // message display time (milliseconds)

typedef unsigned char byte;
typedef unsigned long ulong;

#endif  // _DEFINES_H


